sonictruth/esp32-matrix/src/aurora/Effects.h
/*
 * Aurora: https://github.com/pixelmatix/aurora
 * Copyright (c) 2014 Jason Coon
 *
 * Portions of this code are adapted from "Funky Clouds" by Stefan Petrick: https://gist.github.com/anonymous/876f908333cd95315c35
 * Portions of this code are adapted from "NoiseSmearing" by Stefan Petrick: https://gist.github.com/StefanPetrick/9ee2f677dbff64e3ba7a
 * Copyright (c) 2014 Stefan Petrick
 * http://www.stefan-petrick.de/wordpress_beta
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

#pragma once
#ifndef Effects_H
#define Effects_H

#include <stdint.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <FastLED.h>

/* ---------------------------- GLOBAL CONSTANTS ----------------------------- */

extern GFXcanvas16 *canvas;
const int MATRIX_CENTER_X = MATRIX_WIDTH / 2;
const int MATRIX_CENTER_Y = MATRIX_HEIGHT / 2;

#define MATRIX_CENTRE_X MATRIX_CENTER_X
#define MATRIX_CENTRE_Y MATRIX_CENTER_Y

const uint16_t NUM_LEDS = (MATRIX_WIDTH * MATRIX_HEIGHT) + 1; // one led spare to capture out of bounds

// forward declaration
uint16_t XY16(uint16_t x, uint16_t y);

/* Convert x,y co-ordinate to flat array index.
 * x and y positions start from 0, so must not be >= 'real' panel width or height
 * (i.e. 64 pixels or 32 pixels.).  Max value: MATRIX_WIDTH-1 etc.
 * Ugh... uint8_t - really??? this weak method can't cope with 256+ pixel matrices :(
 */
uint16_t XY(uint8_t x, uint8_t y)
{
  return XY16(x, y);
}

/**
 *  The one for 256+ matrices
 *  otherwise this:
 *    for (uint8_t i = 0; i < MATRIX_WIDTH; i++) {}
 *  turns into an infinite loop
 */
uint16_t XY16(uint16_t x, uint16_t y)
{
  if (x >= MATRIX_WIDTH)
    return 0;
  if (y >= MATRIX_HEIGHT)
    return 0;

  return (y * MATRIX_WIDTH) + x + 1; // everything offset by one to compute out of bounds stuff - never displayed by ShowFrame()
}

uint8_t beatcos8(accum88 beats_per_minute, uint8_t lowest = 0, uint8_t highest = 255, uint32_t timebase = 0, uint8_t phase_offset = 0)
{
  uint8_t beat = beat8(beats_per_minute, timebase);
  uint8_t beatcos = cos8(beat + phase_offset);
  uint8_t rangewidth = highest - lowest;
  uint8_t scaledbeat = scale8(beatcos, rangewidth);
  uint8_t result = lowest + scaledbeat;
  return result;
}

uint8_t mapsin8(uint8_t theta, uint8_t lowest = 0, uint8_t highest = 255)
{
  uint8_t beatsin = sin8(theta);
  uint8_t rangewidth = highest - lowest;
  uint8_t scaledbeat = scale8(beatsin, rangewidth);
  uint8_t result = lowest + scaledbeat;
  return result;
}

uint8_t mapcos8(uint8_t theta, uint8_t lowest = 0, uint8_t highest = 255)
{
  uint8_t beatcos = cos8(theta);
  uint8_t rangewidth = highest - lowest;
  uint8_t scaledbeat = scale8(beatcos, rangewidth);
  uint8_t result = lowest + scaledbeat;
  return result;
}

// Array of temperature readings at each simulation cell
// byte heat[NUM_LEDS];    // none of the currently enabled effects uses this

uint32_t noise_x;
uint32_t noise_y;
uint32_t noise_z;
uint32_t noise_scale_x;
uint32_t noise_scale_y;

uint8_t **noise = nullptr;
uint8_t noisesmoothing;

class Effects
{
public:
  CRGB *leds;

  Effects()
  {

    // we do dynamic allocation for leds buffer, otherwise esp32 toolchain can't link static arrays of such a big size for 256+ matrices
    leds = (CRGB *)malloc(NUM_LEDS * sizeof(CRGB));

    // allocate mem for noise effect
    // (there should be some guards for malloc errors eventually)
    noise = (uint8_t **)malloc(MATRIX_WIDTH * sizeof(uint8_t *));
    for (int i = 0; i < MATRIX_WIDTH; ++i)
    {
      noise[i] = (uint8_t *)malloc(MATRIX_HEIGHT * sizeof(uint8_t));
    }
    ClearFrame();
  }

  ~Effects()
  {
    free(leds);
    for (int i = 0; i < MATRIX_WIDTH; ++i)
    {
      free(noise[i]);
    }
    free(noise);
  }

  /* The only 'framebuffer' we have is what is contained in the leds and leds2 variables.
   * We don't store what the color a particular pixel might be, other than when it's turned
   * into raw electrical signal output gobbly-gook (i.e. the DMA matrix buffer), but this * is not reversible.
   *
   * As such, any time these effects want to write a pixel color, we first have to update
   * the leds or leds2 array, and THEN write it to the RGB panel. This enables us to 'look up' the array to see what a pixel color was previously, each drawFrame().
   */
  void drawBackgroundFastLEDPixelCRGB(int16_t x, int16_t y, CRGB color)
  {
    leds[XY(x, y)] = color;
  }

  // write one pixel with the specified color from the current palette to coordinates
  void Pixel(int x, int y, uint8_t colorIndex)
  {
    leds[XY(x, y)] = ColorFromCurrentPalette(colorIndex);
  }

  void PrepareFrame()
  {
    // leds = (CRGB*) backgroundLayer.backBuffer();
  }

  void ShowFrame()
  {
    // #if (FASTLED_VERSION >= 3001000)
    //       nblendPaletteTowardPalette(currentPalette, targetPalette, 24);
    // #else
    currentPalette = targetPalette;
    // #endif

    //  backgroundLayer.swapBuffers();
    // leds = (CRGB*) backgroundLayer.backBuffer();
    // LEDS.countFPS();

    for (int y = 0; y < MATRIX_HEIGHT; ++y)
    {
      for (int x = 0; x < MATRIX_WIDTH; ++x)
      {
        // Serial.printf("Flushing x, y coord %d, %d\n", x, y);
        uint16_t _pixel = XY16(x, y);
        // dma_display->drawPixelRGB888(x, y, leds[_pixel].r, leds[_pixel].g, leds[_pixel].b);
        uint16_t color = ((leds[_pixel].r >> 3) << 11) | ((leds[_pixel].g >> 2) << 5) | (leds[_pixel].b >> 3);
        ;
        // ( << 16) + (leds[_pixel].g << 8) + leds[_pixel].b;

