sonictruth/esp32-matrix/src/aurora/Effects.h
        canvas->drawPixel(x, y, color);
      } // end loop to copy fast led to the dma matrix
    }
  }

  // scale the brightness of the screenbuffer down
  void DimAll(byte value)
  {
    for (int i = 0; i < NUM_LEDS; i++)
    {
      leds[i].nscale8(value);
    }
  }

  void ClearFrame()
  {
    memset(leds, 0x00, NUM_LEDS * sizeof(CRGB)); // flush
  }

  // palettes
  static const int paletteCount = 10;
  int paletteIndex = -1;
  TBlendType currentBlendType = LINEARBLEND;
  CRGBPalette16 currentPalette;
  CRGBPalette16 targetPalette;
  char *currentPaletteName;

  static const int HeatColorsPaletteIndex = 6;
  static const int RandomPaletteIndex = 9;

  void Setup()
  {
    currentPalette = RainbowColors_p;
    loadPalette(1);
    NoiseVariablesSetup();
  }

  void CyclePalette(int offset = 1)
  {
    loadPalette(paletteIndex + offset);
  }

  void RandomPalette()
  {
    loadPalette(RandomPaletteIndex);
  }

  void loadPalette(int index)
  {
    paletteIndex = index;

    if (paletteIndex >= paletteCount)
      paletteIndex = 0;
    else if (paletteIndex < 0)
      paletteIndex = paletteCount - 1;

    switch (paletteIndex)
    {
    case 0:
      targetPalette = RainbowColors_p;
      currentPaletteName = (char *)"Rainbow";
      break;
    case 1:
      targetPalette = OceanColors_p;
      currentPaletteName = (char *)"Ocean";
      break;
    case 2:
      targetPalette = CloudColors_p;
      currentPaletteName = (char *)"Cloud";
      break;
    case 3:
      targetPalette = ForestColors_p;
      currentPaletteName = (char *)"Forest";
      break;
    case 4:
      targetPalette = PartyColors_p;
      currentPaletteName = (char *)"Party";
      break;
    case 5:
      setupGrayscalePalette();
      currentPaletteName = (char *)"Grey";
      break;
    case HeatColorsPaletteIndex:
      targetPalette = HeatColors_p;
      currentPaletteName = (char *)"Heat";
      break;
    case 7:
      targetPalette = LavaColors_p;
      currentPaletteName = (char *)"Lava";
      break;
    case 8:
      setupIcePalette();
      currentPaletteName = (char *)"Ice";
      break;
    case RandomPaletteIndex:
      loadPalette(random(0, paletteCount - 1));
      paletteIndex = RandomPaletteIndex;
      currentPaletteName = (char *)"Random";
      break;
    }
  }

  void setPalette(String paletteName)
  {
    if (paletteName == "Rainbow")
      loadPalette(0);
    else if (paletteName == "Ocean")
      loadPalette(1);
    else if (paletteName == "Cloud")
      loadPalette(2);
    else if (paletteName == "Forest")
      loadPalette(3);
    else if (paletteName == "Party")
      loadPalette(4);
    else if (paletteName == "Grayscale")
      loadPalette(5);
    else if (paletteName == "Heat")
      loadPalette(6);
    else if (paletteName == "Lava")
      loadPalette(7);
    else if (paletteName == "Ice")
      loadPalette(8);
    else if (paletteName == "Random")
      RandomPalette();
  }

  void listPalettes()
  {
    Serial.println(F("{"));
    Serial.print(F("  \"count\": "));
    Serial.print(paletteCount);
    Serial.println(",");
    Serial.println(F("  \"results\": ["));

    String paletteNames[] = {
        "Rainbow",
        "Ocean",
        "Cloud",
        "Forest",
        "Party",
        "Grayscale",
        "Heat",
        "Lava",
        "Ice",
        "Random"};

    for (int i = 0; i < paletteCount; i++)
    {
      Serial.print(F("    \""));
      Serial.print(paletteNames[i]);
      if (i == paletteCount - 1)
        Serial.println(F("\""));
      else
        Serial.println(F("\","));
    }

    Serial.println("  ]");
    Serial.println("}");
  }

  void setupGrayscalePalette()
  {
    targetPalette = CRGBPalette16(CRGB::Black, CRGB::White);
  }

  void setupIcePalette()
  {
    targetPalette = CRGBPalette16(CRGB::Black, CRGB::Blue, CRGB::Aqua, CRGB::White);
  }

  // Oscillators and Emitters

  // the oscillators: linear ramps 0-255
  byte osci[6];

  // sin8(osci) swinging between 0 to MATRIX_WIDTH - 1
  byte p[6];

  // set the speeds (and by that ratios) of the oscillators here
  void MoveOscillators()
  {
    osci[0] = osci[0] + 5;
    osci[1] = osci[1] + 2;
    osci[2] = osci[2] + 3;
    osci[3] = osci[3] + 4;
    osci[4] = osci[4] + 1;
    if (osci[4] % 2 == 0)
      osci[5] = osci[5] + 1; // .5
    for (int i = 0; i < 4; i++)
    {
      p[i] = map8(sin8(osci[i]), 0, MATRIX_WIDTH - 1); // why? to keep the result in the range of 0-MATRIX_WIDTH (matrix size)
    }
  }

  // All the caleidoscope functions work directly within the screenbuffer (leds array).
  // Draw whatever you like in the area x(0-15) and y (0-15) and then copy it arround.

  // rotates the first 16x16 quadrant 3 times onto a 32x32 (+90 degrees rotation for each one)
  void Caleidoscope1()
  {
    for (int x = 0; x < MATRIX_CENTER_X; x++)
    {
      for (int y = 0; y < MATRIX_CENTER_Y; y++)
      {
        leds[XY16(MATRIX_WIDTH - 1 - x, y)] = leds[XY16(x, y)];
        leds[XY16(MATRIX_WIDTH - 1 - x, MATRIX_HEIGHT - 1 - y)] = leds[XY16(x, y)];
        leds[XY16(x, MATRIX_HEIGHT - 1 - y)] = leds[XY16(x, y)];
      }
    }
  }

  // mirror the first 16x16 quadrant 3 times onto a 32x32
  void Caleidoscope2()
  {
    for (int x = 0; x < MATRIX_CENTER_X; x++)
    {
      for (int y = 0; y < MATRIX_CENTER_Y; y++)
      {
        leds[XY16(MATRIX_WIDTH - 1 - x, y)] = leds[XY16(y, x)];
        leds[XY16(x, MATRIX_HEIGHT - 1 - y)] = leds[XY16(y, x)];
        leds[XY16(MATRIX_WIDTH - 1 - x, MATRIX_HEIGHT - 1 - y)] = leds[XY16(x, y)];
      }
    }
  }

  // copy one diagonal triangle into the other one within a 16x16
  void Caleidoscope3()
  {
    for (int x = 0; x <= MATRIX_CENTRE_X && x < MATRIX_HEIGHT; x++)
    {
      for (int y = 0; y <= x && y < MATRIX_HEIGHT; y++)
      {
        leds[XY16(x, y)] = leds[XY16(y, x)];
      }
    }
  }

  // copy one diagonal triangle into the other one within a 16x16 (90 degrees rotated compared to Caleidoscope3)
  void Caleidoscope4()
  {
    for (int x = 0; x <= MATRIX_CENTRE_X; x++)
    {
      for (int y = 0; y <= MATRIX_CENTRE_Y - x; y++)
      {
        leds[XY16(MATRIX_CENTRE_Y - y, MATRIX_CENTRE_X - x)] = leds[XY16(x, y)];
      }
    }
  }

