sonictruth/esp32-matrix/src/aurora/Effects.h
  // copy one diagonal triangle into the other one within a 8x8
  void Caleidoscope5()
  {
    for (int x = 0; x < MATRIX_WIDTH / 4; x++)
    {
      for (int y = 0; y <= x && y <= MATRIX_HEIGHT; y++)
      {
        leds[XY16(x, y)] = leds[XY16(y, x)];
      }
    }

    for (int x = MATRIX_WIDTH / 4; x < MATRIX_WIDTH / 2; x++)
    {
      for (int y = MATRIX_HEIGHT / 4; y >= 0; y--)
      {
        leds[XY16(x, y)] = leds[XY16(y, x)];
      }
    }
  }

  void Caleidoscope6()
  {
    for (int x = 1; x < MATRIX_CENTER_X; x++)
    {
      leds[XY16(7 - x, 7)] = leds[XY16(x, 0)];
    } // a
    for (int x = 2; x < MATRIX_CENTER_X; x++)
    {
      leds[XY16(7 - x, 6)] = leds[XY16(x, 1)];
    } // b
    for (int x = 3; x < MATRIX_CENTER_X; x++)
    {
      leds[XY16(7 - x, 5)] = leds[XY16(x, 2)];
    } // c
    for (int x = 4; x < MATRIX_CENTER_X; x++)
    {
      leds[XY16(7 - x, 4)] = leds[XY16(x, 3)];
    } // d
    for (int x = 5; x < MATRIX_CENTER_X; x++)
    {
      leds[XY16(7 - x, 3)] = leds[XY16(x, 4)];
    } // e
    for (int x = 6; x < MATRIX_CENTER_X; x++)
    {
      leds[XY16(7 - x, 2)] = leds[XY16(x, 5)];
    } // f
    for (int x = 7; x < MATRIX_CENTER_X; x++)
    {
      leds[XY16(7 - x, 1)] = leds[XY16(x, 6)];
    } // g
  }

  // create a square twister to the left or counter-clockwise
  // x and y for center, r for radius
  void SpiralStream(int x, int y, int r, byte dimm)
  {
    for (int d = r; d >= 0; d--)
    { // from the outside to the inside
      for (int i = x - d; i <= x + d; i++)
      {
        leds[XY16(i, y - d)] += leds[XY16(i + 1, y - d)]; // lowest row to the right
        leds[XY16(i, y - d)].nscale8(dimm);
      }
      for (int i = y - d; i <= y + d; i++)
      {
        leds[XY16(x + d, i)] += leds[XY16(x + d, i + 1)]; // right column up
        leds[XY16(x + d, i)].nscale8(dimm);
      }
      for (int i = x + d; i >= x - d; i--)
      {
        leds[XY16(i, y + d)] += leds[XY16(i - 1, y + d)]; // upper row to the left
        leds[XY16(i, y + d)].nscale8(dimm);
      }
      for (int i = y + d; i >= y - d; i--)
      {
        leds[XY16(x - d, i)] += leds[XY16(x - d, i - 1)]; // left column down
        leds[XY16(x - d, i)].nscale8(dimm);
      }
    }
  }

  // expand everything within a circle
  void Expand(int centerX, int centerY, int radius, byte dimm)
  {
    if (radius == 0)
      return;

    int currentRadius = radius;

    while (currentRadius > 0)
    {
      int a = radius, b = 0;
      int radiusError = 1 - a;

      int nextRadius = currentRadius - 1;
      int nextA = nextRadius - 1, nextB = 0;
      int nextRadiusError = 1 - nextA;

      while (a >= b)
      {
        // move them out one pixel on the radius
        leds[XY16(a + centerX, b + centerY)] = leds[XY16(nextA + centerX, nextB + centerY)];
        leds[XY16(b + centerX, a + centerY)] = leds[XY16(nextB + centerX, nextA + centerY)];
        leds[XY16(-a + centerX, b + centerY)] = leds[XY16(-nextA + centerX, nextB + centerY)];
        leds[XY16(-b + centerX, a + centerY)] = leds[XY16(-nextB + centerX, nextA + centerY)];
        leds[XY16(-a + centerX, -b + centerY)] = leds[XY16(-nextA + centerX, -nextB + centerY)];
        leds[XY16(-b + centerX, -a + centerY)] = leds[XY16(-nextB + centerX, -nextA + centerY)];
        leds[XY16(a + centerX, -b + centerY)] = leds[XY16(nextA + centerX, -nextB + centerY)];
        leds[XY16(b + centerX, -a + centerY)] = leds[XY16(nextB + centerX, -nextA + centerY)];

        // dim them
        leds[XY16(a + centerX, b + centerY)].nscale8(dimm);
        leds[XY16(b + centerX, a + centerY)].nscale8(dimm);
        leds[XY16(-a + centerX, b + centerY)].nscale8(dimm);
        leds[XY16(-b + centerX, a + centerY)].nscale8(dimm);
        leds[XY16(-a + centerX, -b + centerY)].nscale8(dimm);
        leds[XY16(-b + centerX, -a + centerY)].nscale8(dimm);
        leds[XY16(a + centerX, -b + centerY)].nscale8(dimm);
        leds[XY16(b + centerX, -a + centerY)].nscale8(dimm);

        b++;
        if (radiusError < 0)
          radiusError += 2 * b + 1;
        else
        {
          a--;
          radiusError += 2 * (b - a + 1);
        }

        nextB++;
        if (nextRadiusError < 0)
          nextRadiusError += 2 * nextB + 1;
        else
        {
          nextA--;
          nextRadiusError += 2 * (nextB - nextA + 1);
        }
      }

      currentRadius--;
    }
  }

  // give it a linear tail to the right
  void StreamRight(byte scale, int fromX = 0, int toX = MATRIX_WIDTH, int fromY = 0, int toY = MATRIX_HEIGHT)
  {
    for (int x = fromX + 1; x < toX; x++)
    {
      for (int y = fromY; y < toY; y++)
      {
        leds[XY16(x, y)] += leds[XY16(x - 1, y)];
        leds[XY16(x, y)].nscale8(scale);
      }
    }
    for (int y = fromY; y < toY; y++)
      leds[XY16(0, y)].nscale8(scale);
  }

  // give it a linear tail to the left
  void StreamLeft(byte scale, int fromX = MATRIX_WIDTH, int toX = 0, int fromY = 0, int toY = MATRIX_HEIGHT)
  {
    for (int x = toX; x < fromX; x++)
    {
      for (int y = fromY; y < toY; y++)
      {
        leds[XY16(x, y)] += leds[XY16(x + 1, y)];
        leds[XY16(x, y)].nscale8(scale);
      }
    }
    for (int y = fromY; y < toY; y++)
      leds[XY16(0, y)].nscale8(scale);
  }

  // give it a linear tail downwards
  void StreamDown(byte scale)
  {
    for (int x = 0; x < MATRIX_WIDTH; x++)
    {
      for (int y = 1; y < MATRIX_HEIGHT; y++)
      {
        leds[XY16(x, y)] += leds[XY16(x, y - 1)];
        leds[XY16(x, y)].nscale8(scale);
      }
    }
    for (int x = 0; x < MATRIX_WIDTH; x++)
      leds[XY16(x, 0)].nscale8(scale);
  }

  // give it a linear tail upwards
  void StreamUp(byte scale)
  {
    for (int x = 0; x < MATRIX_WIDTH; x++)
    {
      for (int y = MATRIX_HEIGHT - 2; y >= 0; y--)
      {
        leds[XY16(x, y)] += leds[XY16(x, y + 1)];
        leds[XY16(x, y)].nscale8(scale);
      }
    }
    for (int x = 0; x < MATRIX_WIDTH; x++)
      leds[XY16(x, MATRIX_HEIGHT - 1)].nscale8(scale);
  }

  // give it a linear tail up and to the left
  void StreamUpAndLeft(byte scale)
  {
    for (int x = 0; x < MATRIX_WIDTH - 1; x++)
    {
      for (int y = MATRIX_HEIGHT - 2; y >= 0; y--)
      {
        leds[XY16(x, y)] += leds[XY16(x + 1, y + 1)];
        leds[XY16(x, y)].nscale8(scale);
      }
    }
    for (int x = 0; x < MATRIX_WIDTH; x++)
      leds[XY16(x, MATRIX_HEIGHT - 1)].nscale8(scale);
    for (int y = 0; y < MATRIX_HEIGHT; y++)
      leds[XY16(MATRIX_WIDTH - 1, y)].nscale8(scale);
  }

  // give it a linear tail up and to the right
  void StreamUpAndRight(byte scale)
  {
    for (int x = 0; x < MATRIX_WIDTH - 1; x++)
    {
      for (int y = MATRIX_HEIGHT - 2; y >= 0; y--)
      {
        leds[XY16(x + 1, y)] += leds[XY16(x, y + 1)];
        leds[XY16(x, y)].nscale8(scale);
      }
    }
    // fade the bottom row
    for (int x = 0; x < MATRIX_WIDTH; x++)
      leds[XY16(x, MATRIX_HEIGHT - 1)].nscale8(scale);

