sonictruth/esp32-matrix/src/aurora/Effects.h
    // fade the right column
    for (int y = 0; y < MATRIX_HEIGHT; y++)
      leds[XY16(MATRIX_WIDTH - 1, y)].nscale8(scale);
  }

  // just move everything one line down
  void MoveDown()
  {
    for (int y = MATRIX_HEIGHT - 1; y > 0; y--)
    {
      for (int x = 0; x < MATRIX_WIDTH; x++)
      {
        leds[XY16(x, y)] = leds[XY16(x, y - 1)];
      }
    }
  }

  // just move everything one line down
  void VerticalMoveFrom(int start, int end)
  {
    for (int y = end; y > start; y--)
    {
      for (int x = 0; x < MATRIX_WIDTH; x++)
      {
        leds[XY16(x, y)] = leds[XY16(x, y - 1)];
      }
    }
  }

  // copy the rectangle defined with 2 points x0, y0, x1, y1
  // to the rectangle beginning at x2, x3
  void Copy(byte x0, byte y0, byte x1, byte y1, byte x2, byte y2)
  {
    for (int y = y0; y < y1 + 1; y++)
    {
      for (int x = x0; x < x1 + 1; x++)
      {
        leds[XY16(x + x2 - x0, y + y2 - y0)] = leds[XY16(x, y)];
      }
    }
  }

  // rotate + copy triangle (MATRIX_CENTER_X*MATRIX_CENTER_X)
  void RotateTriangle()
  {
    for (int x = 1; x < MATRIX_CENTER_X; x++)
    {
      for (int y = 0; y < x; y++)
      {
        leds[XY16(x, 7 - y)] = leds[XY16(7 - x, y)];
      }
    }
  }

  // mirror + copy triangle (MATRIX_CENTER_X*MATRIX_CENTER_X)
  void MirrorTriangle()
  {
    for (int x = 1; x < MATRIX_CENTER_X; x++)
    {
      for (int y = 0; y < x; y++)
      {
        leds[XY16(7 - y, x)] = leds[XY16(7 - x, y)];
      }
    }
  }

  // draw static rainbow triangle pattern (MATRIX_CENTER_XxWIDTH / 2)
  // (just for debugging)
  void RainbowTriangle()
  {
    for (int i = 0; i < MATRIX_CENTER_X; i++)
    {
      for (int j = 0; j <= i; j++)
      {
        Pixel(7 - i, j, i * j * 4);
      }
    }
  }

  void BresenhamLine(int x0, int y0, int x1, int y1, byte colorIndex)
  {
    BresenhamLine(x0, y0, x1, y1, ColorFromCurrentPalette(colorIndex));
  }

  void BresenhamLine(int x0, int y0, int x1, int y1, CRGB color)
  {
    int dx = abs(x1 - x0), sx = x0 < x1 ? 1 : -1;
    int dy = -abs(y1 - y0), sy = y0 < y1 ? 1 : -1;
    int err = dx + dy, e2;
    for (;;)
    {
      leds[XY16(x0, y0)] += color;
      if (x0 == x1 && y0 == y1)
        break;
      e2 = 2 * err;
      if (e2 > dy)
      {
        err += dy;
        x0 += sx;
      }
      if (e2 < dx)
      {
        err += dx;
        y0 += sy;
      }
    }
  }

  CRGB ColorFromCurrentPalette(uint8_t index = 0, uint8_t brightness = 255, TBlendType blendType = LINEARBLEND)
  {
    return ColorFromPalette(currentPalette, index, brightness, currentBlendType);
  }

  CRGB HsvToRgb(uint8_t h, uint8_t s, uint8_t v)
  {
    CHSV hsv = CHSV(h, s, v);
    CRGB rgb;
    hsv2rgb_spectrum(hsv, rgb);
    return rgb;
  }

  void NoiseVariablesSetup()
  {
    noisesmoothing = 200;

    noise_x = random16();
    noise_y = random16();
    noise_z = random16();
    noise_scale_x = 6000;
    noise_scale_y = 6000;
  }

  void FillNoise()
  {
    for (uint16_t i = 0; i < MATRIX_WIDTH; i++)
    {
      uint32_t ioffset = noise_scale_x * (i - MATRIX_CENTRE_Y);

      for (uint16_t j = 0; j < MATRIX_HEIGHT; j++)
      {
        uint32_t joffset = noise_scale_y * (j - MATRIX_CENTRE_Y);

        byte data = inoise16(noise_x + ioffset, noise_y + joffset, noise_z) >> 8;

        uint8_t olddata = noise[i][j];
        uint8_t newdata = scale8(olddata, noisesmoothing) + scale8(data, 256 - noisesmoothing);
        data = newdata;

        noise[i][j] = data;
      }
    }
  }

  // non leds2 memory version.
  void MoveX(byte delta)
  {

    CRGB tmp = 0;

    for (int y = 0; y < MATRIX_HEIGHT; y++)
    {

      // Shift Left: https://codedost.com/c/arraypointers-in-c/c-program-shift-elements-array-left-direction/
      // Computationally heavier but doesn't need an entire leds2 array

      tmp = leds[XY16(0, y)];
      for (int m = 0; m < delta; m++)
      {
        // Do this delta time for each row... computationally expensive potentially.
        for (int x = 0; x < MATRIX_WIDTH; x++)
        {
          leds[XY16(x, y)] = leds[XY16(x + 1, y)];
        }

        leds[XY16(MATRIX_WIDTH - 1, y)] = tmp;
      }

      /*
      // Shift
      for (int x = 0; x < MATRIX_WIDTH - delta; x++) {
        leds2[XY(x, y)] = leds[XY(x + delta, y)];
      }

      // Wrap around
      for (int x = MATRIX_WIDTH - delta; x < MATRIX_WIDTH; x++) {
        leds2[XY(x, y)] = leds[XY(x + delta - MATRIX_WIDTH, y)];
      }
      */
    } // end row loop

    /*
    // write back to leds
    for (uint8_t y = 0; y < MATRIX_HEIGHT; y++) {
      for (uint8_t x = 0; x < MATRIX_WIDTH; x++) {
        leds[XY(x, y)] = leds2[XY(x, y)];
      }
    }
    */
  }

  void MoveY(byte delta)
  {

    CRGB tmp = 0;
    for (int x = 0; x < MATRIX_WIDTH; x++)
    {
      tmp = leds[XY16(x, 0)];
      for (int m = 0; m < delta; m++) // moves
      {
        // Do this delta time for each row... computationally expensive potentially.
        for (int y = 0; y < MATRIX_HEIGHT; y++)
        {
          leds[XY16(x, y)] = leds[XY16(x, y + 1)];
        }

        leds[XY16(x, MATRIX_HEIGHT - 1)] = tmp;
      }
    } // end column loop
  }   /// MoveY
};

#endif